In [33]:
#Задание 1

"""Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
Определите какому фильму было выставлено больше всего оценок 5.0."""

import pandas as pd
rating = pd.read_csv('ratings.csv', usecols = ['movieId','rating']) #выводим только столбцы с названием movieId и rating
rating.head()

   movieId  rating
0      296     5.0
1      306     3.5
2      307     5.0
3      665     5.0
4      899     3.5

In [13]:
movies=pd.read_csv('movies.csv', usecols = ['movieId','title'])
movies.head()

   movieId                               title
0        1                    Toy Story (1995)
1        2                      Jumanji (1995)
2        3             Grumpier Old Men (1995)
3        4            Waiting to Exhale (1995)
4        5  Father of the Bride Part II (1995)

In [14]:
joined = movies.merge(rating, on='movieId', how='left') #обединили 2 файла
joined.head()

   movieId             title  rating
0        1  Toy Story (1995)     3.5
1        1  Toy Story (1995)     4.0
2        1  Toy Story (1995)     3.0
3        1  Toy Story (1995)     4.0
4        1  Toy Story (1995)     4.0

In [25]:
max_=rating['rating'].max()
filtered_joined=joined[(joined ['rating']==max_)]
fr=filtered_joined.groupby(['movieId' , 'title'])['movieId'].count() #считаем сколько раз упоминается фильм, так как оставили фильмы  только с максимальным рейтингом

In [26]:
fr.sort_values(ascending=False).head()

movieId  title
318      Shawshank Redemption, The (1994)             39553
296      Pulp Fiction (1994)                          32169
356      Forrest Gump (1994)                          25918
260      Star Wars: Episode IV - A New Hope (1977)    25804
2571     Matrix, The (1999)                           25482
Name: movieId, dtype: int64

In [27]:
#Задание 2

"""По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity."""


power=pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [28]:
filtered_countries = power[(power['country']=='Estonia') | (power['country']=='Lithuania') | (power['country']=='Latvia') ]
filtered_countries.head()

       country  year  quantity  category
373  Lithuania  2014      39.0         1
374  Lithuania  2013     192.0         1
375  Lithuania  2012     196.0         1
376  Lithuania  2011     171.0         1
377  Lithuania  2010     158.0         1

In [31]:
fc=filtered_countries[(filtered_countries['category']==4) | (filtered_countries['category']==12) 
                      | (filtered_countries['category']==21) & (filtered_countries['year']<2010) & 
                      (filtered_countries['year']>2005)]
fc_sum = fc['quantity'].sum()

In [32]:
print(f'Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно: {fc_sum}')

Количество потребления для стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года равно: 165867.0

In [36]:
#Задание 3

"""Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe."""

data=pd.read_html('https://fortrader.org/quotes')[2] #для примера взяла таблицу номер 3. Так можно менять индекс и выводить нужную
data.head()

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0       Золото Цена золота на бирже  1 733      -1.00         -0.00        NaN
1  Серебро Цена на серебро на бирже  26.59      -0.06         -0.22        NaN
2         Палладий Цена на Палладий  2 294      -7.00         -0.00        NaN
3           Платина Цены на платину  1 191      -1.00         -0.00        NaN
4           Медь Цена меди на бирже   4.10       0.00          0.09        NaN